In [14]:
import pandas as pd

In [5]:
#Series


s = pd.Series([45,67,32,14,82])

In [6]:
s

0    45
1    67
2    32
3    14
4    82
dtype: int64

In [7]:
s = pd.Series([45,67,32,14,82,32.17])

In [8]:
s

0    45.00
1    67.00
2    32.00
3    14.00
4    82.00
5    32.17
dtype: float64

In [9]:
s[3]

14.0

In [10]:
s[3] =100

In [11]:
s

0     45.00
1     67.00
2     32.00
3    100.00
4     82.00
5     32.17
dtype: float64

In [12]:
s = pd.Series([45,67,32,14,82,32.17],index = range(100,106))

In [13]:
s

100    45.00
101    67.00
102    32.00
103    14.00
104    82.00
105    32.17
dtype: float64

In [15]:
##Dataframes

roll = pd.Series([1,2,3,4,5])
name = pd.Series(['Ajinkya','Amruta','Raj','natasha','neo'])
marks =pd.Series([76,73,81,88,85])

In [18]:
df = pd.DataFrame({
    'roll' : roll,
    'name' : name,
    'marks' : marks
})

In [19]:
df

   roll     name  marks
0     1  Ajinkya     76
1     2   Amruta     73
2     3      Raj     81
3     4  natasha     88
4     5      neo     85

In [20]:
import os
os.getcwd()

'C:\\Users\\DELL'

In [ ]:
#location:https://mitu.co.in/dataset
#dowmload all the files starting from student and put them in same folder

In [21]:
## import the data

df = pd.read_csv('Student.csv') #comma seperated varals

In [22]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [23]:
df1 = pd.read_csv('Student1.csv')

In [24]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [25]:
header = ['A','B','C','D','E']

In [26]:
df1 =pd.read_csv('student1.csv',names=header)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [33]:
df1 = pd.read_csv('Student3.tsv',sep = '\t') #tab seperated val  ##same like this but give the specific path of the file ,result as the same

In [34]:
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [45]:
df1 =pd.read_csv(r'c:\Users\DELL\student3.tsv',sep = '\t')
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [46]:
df.shape

(10, 5)

In [47]:
df.size

50

In [51]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [58]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

In [59]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [60]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [61]:
df.empty

False

In [62]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [63]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [64]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [65]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [66]:
df.tail(2)

   roll   name class  marks  age
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

In [67]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [68]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [69]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [71]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [72]:
#data slicing

df.iloc[3:6,0:3]

   roll     name class
3     4  ajinkya    TE
4     5     asha    TE
5     6   ayesha    BE

In [80]:
df.iloc[6: ,1:4]#empty space indicate the all value after the 6

    name class  marks
6   amar    BE  65.34
7  amita    BE  68.33
8   amol    TE  56.75
9  anmol    BE  78.66

In [91]:
df.iloc[[3,5,7,8],[0,2,3]]

   roll class  marks
3     4    TE  69.66
5     6    BE  49.55
7     8    BE  68.33
8     9    TE  56.75

In [96]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [100]:
df.iloc[5,1]

'ayesha'

In [101]:
df.loc[2:5,'name']

2     aniket
3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [106]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [107]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [108]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64